In [1]:
import pandas as pd
import numpy as np

In [82]:
# load text

In [83]:
df = pd.read_csv('./data/suicide-death-rates.csv')
print(df.shape)

(6468, 4)

In [84]:
df.columns = ['Entity', 'Code', 'Year', 'Deaths_rate']
df.head()

        Entity Code  Year  Deaths_rate
0  Afghanistan  AFG  1990    10.318504
1  Afghanistan  AFG  1991    10.327010
2  Afghanistan  AFG  1992    10.271411
3  Afghanistan  AFG  1993    10.376123
4  Afghanistan  AFG  1994    10.575915

In [85]:
# classify countries, and regions

In [89]:
# drop na
df2 = df.dropna()

# select idx from countries
idx = list(df2.index)

# idx of non countries
idx_not_country = [i for i in range(idx[-1]) if i not in idx]

# df non_countries
df_not_country = df.iloc[idx_not_country]
df_not_country.head()

                   Entity Code  Year  Deaths_rate
112  Andean Latin America  NaN  1990     5.200335
113  Andean Latin America  NaN  1991     5.238619
114  Andean Latin America  NaN  1992     5.564100
115  Andean Latin America  NaN  1993     5.790940
116  Andean Latin America  NaN  1994     5.856975

In [123]:
df2017 = df2[df2.Year == 2017]
df2017 = df2017[df2017.Code != 'OWID_WRL']

In [124]:
df.Code.iloc[112]

nan

In [132]:
df[df.Entity == 'Lithuania']

         Entity Code  Year  Deaths_rate
3276  Lithuania  LTU  1990    27.969919
3277  Lithuania  LTU  1991    30.868981
3278  Lithuania  LTU  1992    32.840418
3279  Lithuania  LTU  1993    39.460394
3280  Lithuania  LTU  1994    44.145950
3281  Lithuania  LTU  1995    44.773387
3282  Lithuania  LTU  1996    42.797108
3283  Lithuania  LTU  1997    40.783079
3284  Lithuania  LTU  1998    40.659034
3285  Lithuania  LTU  1999    40.140720
3286  Lithuania  LTU  2000    40.406953
3287  Lithuania  LTU  2001    41.522788
3288  Lithuania  LTU  2002    39.887335
3289  Lithuania  LTU  2003    38.455156
3290  Lithuania  LTU  2004    37.541459
3291  Lithuania  LTU  2005    38.560108
3292  Lithuania  LTU  2006    38.338954
3293  Lithuania  LTU  2007    39.551637
3294  Lithuania  LTU  2008    37.034944
3295  Lithuania  LTU  2009    32.809684
3296  Lithuania  LTU  2010    32.010115
3297  Lithuania  LTU  2011    31.325176
3298  Lithuania  LTU  2012    30.975566
3299  Lithuania  LTU  2013    31.899756
3300  Lithuania  LTU  2014    30.410189
3301  Lithuania  LTU  2015    29.417319
3302  Lithuania  LTU  2016    28.176800
3303  Lithuania  LTU  2017    27.990584

In [137]:
df2017.sort_values(by='Deaths_rate', ascending=False).head(10)

                Entity Code  Year  Deaths_rate
2267         Greenland  GRL  2017    51.063239
3219           Lesotho  LSO  2017    31.715218
3303         Lithuania  LTU  2017    27.990584
6467          Zimbabwe  ZWE  2017    26.391769
3023          Kiribati  KIR  2017    26.378631
2435            Guyana  GUY  2017    26.072110
6019           Ukraine  UKR  2017    25.622225
4703            Russia  RUS  2017    25.087669
5515          Suriname  SUR  2017    24.783072
4451  Papua New Guinea  PNG  2017    23.074353

In [180]:
df3 = df.copy()
df3.index = df.Year
df3 = df3[['Entity', 'Deaths_rate']]

In [188]:
df3

           Entity  Deaths_rate
Year
1990  Afghanistan    10.318504
1991  Afghanistan    10.327010
1992  Afghanistan    10.271411
1993  Afghanistan    10.376123
1994  Afghanistan    10.575915
...           ...          ...
2013     Zimbabwe    28.361200
2014     Zimbabwe    27.605547
2015     Zimbabwe    27.197061
2016     Zimbabwe    26.839591
2017     Zimbabwe    26.391769

[6468 rows x 2 columns]

In [194]:
df3[(df3.Entity == 'Portugal') | (df3.Entity == 'Spain')]
# df3[df3.Entity == 'Spain'].plot();

        Entity  Deaths_rate
Year
1990  Portugal    14.003772
1991  Portugal    14.238560
1992  Portugal    13.795203
1993  Portugal    13.213331
1994  Portugal    11.960166
1995  Portugal    11.818263
1996  Portugal    11.541278
1997  Portugal    11.084390
1998  Portugal    10.509945
1999  Portugal    10.150496
2000  Portugal     9.965616
2001  Portugal     9.952449
2002  Portugal     9.850354
2003  Portugal     9.581262
2004  Portugal     9.019864
2005  Portugal     8.749981
2006  Portugal     8.746019
2007  Portugal     9.028785
2008  Portugal     9.131683
2009  Portugal     9.217654
2010  Portugal     9.236452
2011  Portugal     9.030942
2012  Portugal     8.863974
2013  Portugal     8.666408
2014  Portugal     8.527019
2015  Portugal     7.778090
2016  Portugal     7.642019
2017  Portugal     7.687680
1990     Spain     7.402572
1991     Spain     7.445192
1992     Spain     7.225876
1993     Spain     7.130849
1994     Spain     7.091879
1995     Spain     7.118415
1996     Spain     7.133463
1997     Spain     7.044013
1998     Spain     6.961112
1999     Spain     6.951334
2000     Spain     6.757533
2001     Spain     6.639513
2002     Spain     6.603475
2003     Spain     6.662552
2004     Spain     6.452585
2005     Spain     6.344059
2006     Spain     6.161681
2007     Spain     6.170696
2008     Spain     6.132359
2009     Spain     5.952380
2010     Spain     5.804289
2011     Spain     5.823780
2012     Spain     5.872213
2013     Spain     5.806201
2014     Spain     5.801236
2015     Spain     5.853893
2016     Spain     5.592000
2017     Spain     5.506501

In [195]:
df[df.Entity == 'Guyana']

      Entity Code  Year  Deaths_rate
2408  Guyana  GUY  1990    22.013568
2409  Guyana  GUY  1991    22.528064
2410  Guyana  GUY  1992    21.343355
2411  Guyana  GUY  1993    20.638285
2412  Guyana  GUY  1994    20.677361
2413  Guyana  GUY  1995    22.796449
2414  Guyana  GUY  1996    23.416351
2415  Guyana  GUY  1997    24.179089
2416  Guyana  GUY  1998    26.448354
2417  Guyana  GUY  1999    25.624205
2418  Guyana  GUY  2000    23.224380
2419  Guyana  GUY  2001    25.665410
2420  Guyana  GUY  2002    26.669064
2421  Guyana  GUY  2003    27.592024
2422  Guyana  GUY  2004    27.810647
2423  Guyana  GUY  2005    27.995243
2424  Guyana  GUY  2006    27.770331
2425  Guyana  GUY  2007    26.783664
2426  Guyana  GUY  2008    26.267878
2427  Guyana  GUY  2009    26.032849
2428  Guyana  GUY  2010    28.216360
2429  Guyana  GUY  2011    29.420768
2430  Guyana  GUY  2012    29.943250
2431  Guyana  GUY  2013    29.252883
2432  Guyana  GUY  2014    28.170909
2433  Guyana  GUY  2015    27.317856
2434  Guyana  GUY  2016    26.637918
2435  Guyana  GUY  2017    26.072110

##